In [1]:
import pandas as pd
import numpy as np

In [57]:
data = pd.read_csv('Data/prev_data.csv')
df_old= pd.read_csv('Data/data20220406.csv')
df_age = pd.read_csv('Data/age.csv')

In [58]:
data.head()

,date_at,mois,product_type,category,country,valeur,loss,reimburse
0,2022-03-31 00:00:00,2022-03,Adapter Fan,accessories,Niger,40800.0,0.0,0.0
1,2022-03-31 00:00:00,2022-03,Adapter Fan,accessories,Nigeria,6800.0,57800.0,3400.0
2,2022-03-31 00:00:00,2022-03,Burn Stove,accessories,Nigeria,0.0,0.0,31500.0
3,2022-03-31 00:00:00,2022-03,Burn Stove Xtra,accessories,Nigeria,0.0,0.0,0.0
4,2022-03-31 00:00:00,2022-03,D Light Radio,accessories,Cameroun,1937166.0,0.0,0.0

In [63]:
df_age.head()

,age,bucket,product_id,age-2,recieved_at,type_movement,tenant_id
0,44.933333,> 12 mois,591.0,44.933333,2018-08-01 08:56:56.446872,receiving,2
1,44.933333,> 12 mois,592.0,44.933333,2018-08-01 08:58:13.364169,receiving,2
2,44.933333,> 12 mois,593.0,44.933333,2018-08-01 08:59:37.428562,receiving,2
3,44.933333,> 12 mois,594.0,44.933333,2018-08-01 09:01:10.445699,receiving,2
4,44.933333,> 12 mois,595.0,44.933333,2018-08-01 09:01:10.445699,receiving,2

In [60]:
data.shape

(190, 8)

In [61]:
data['date_at'].unique()

array(['2022-03-31 00:00:00'], dtype=object)

In [62]:
df_old.head()

,date_at,mois,product_type,category,country,valeur,loss,reimburse
0,2022-04-06 00:00:00.000000,2022-04,Adapter Fan,accessories,Niger,40800.0,0.0,0.0
1,2022-04-06 00:00:00.000000,2022-04,Adapter Fan,accessories,Nigeria,6800.0,57800.0,3400.0
2,2022-04-06 00:00:00.000000,2022-04,Burn Stove,accessories,Nigeria,0.0,0.0,31500.0
3,2022-04-06 00:00:00.000000,2022-04,Burn Stove Xtra,accessories,Nigeria,0.0,0.0,0.0
4,2022-04-06 00:00:00.000000,2022-04,D Light Radio,accessories,Cameroun,1937166.0,0.0,0.0

In [8]:
from datetime import date

In [9]:
if date.today().day != 1:
    print('not first day of the month')

not first day of the month

In [44]:
table_value = data.groupby('mois').sum()
table_value['% Stock losses'] = np.round(table_value['loss']/table_value['valeur'] *100,2)

In [45]:
# data.groupby('mois').sum().transpose()
table_value = table_value.transpose().reset_index()
table_value.columns

Index(['index', '2022-03'], dtype='object', name='mois')

In [46]:
table_value.rename(columns= {'index':'KPI'},inplace=True)

In [47]:
table_value

mois             KPI       2022-03
0             valeur  4.456718e+08
1               loss  1.440206e+07
2          reimburse  4.774896e+06
3     % Stock losses  3.230000e+00

In [52]:
table_value.to_dict('records')

[{'KPI': 'valeur', '2022-03': 445671827.92422},
 {'KPI': 'loss', '2022-03': 14402060.34626},
 {'KPI': 'reimburse', '2022-03': 4774896.25626},
 {'KPI': '% Stock losses', '2022-03': 3.23}]

In [27]:
print(table_value.to_dict('records'))

[{'KPI': 'valeur', '2022-03': 445671827.92422}, {'KPI': 'loss', '2022-03': 14402060.34626}, {'KPI': 'reimburse', '2022-03': 4774896.25626}]

In [51]:
table_loss = pd.pivot_table(data, values=['valeur'],columns=['mois'], aggfunc=np.sum, fill_value=0).reset_index()
table_loss

mois   index       2022-03
0     valeur  4.456718e+08

In [11]:
table_value = pd.pivot_table(data, values='valeur', index=['category'],
                    columns=['mois'], aggfunc=np.sum, fill_value=0).reset_index()

In [71]:
table_value

mois     category       2022-03       2022-04
0          SHS+TV  1.077927e+08  1.057089e+08
1            TV22  1.554650e+05  1.554650e+05
2            TV43  5.360260e+07  5.305680e+07
3     accessories  2.408569e+06  2.408569e+06
4         big SHS  6.543630e+06  6.543630e+06
5            pico  2.782219e+08  2.777984e+08

In [72]:
table_value.dtypes

mois
category     object
2022-03     float64
2022-04     float64
dtype: object

In [73]:
table_loss = pd.pivot_table(data, values='loss', index=['category'],columns=['mois'], aggfunc=np.sum, fill_value=0).reset_index()
table_reimburse = pd.pivot_table(data, values='reimburse', index=['category'],columns=['mois'], aggfunc=np.sum, fill_value=0).reset_index()

In [74]:
table_loss

mois     category       2022-03       2022-04
0          SHS+TV  8.124600e+05  8.124600e+05
1            TV22  0.000000e+00  0.000000e+00
2            TV43  0.000000e+00  0.000000e+00
3     accessories  1.290180e+05  1.290180e+05
4         big SHS  2.529315e+05  2.529315e+05
5            pico  1.320765e+07  1.320765e+07

In [75]:
table_reimburse

mois     category       2022-03       2022-04
0          SHS+TV  2.110000e+05  2.110000e+05
1            TV22  0.000000e+00  0.000000e+00
2            TV43  0.000000e+00  0.000000e+00
3     accessories  3.698900e+05  3.698900e+05
4         big SHS  1.084000e+06  1.084000e+06
5            pico  3.110006e+06  3.110006e+06

In [64]:
data = pd.read_csv('Data/final_data.csv')
data_age = pd.read_csv('Data/age_data.csv')
system_value = pd.pivot_table(data_age, values='valeur',columns=['mois'],index=['category'],aggfunc=np.sum, fill_value=0).reset_index()
age_value = pd.pivot_table(data_age, values='valeur',columns=['mois'],index=['bucket'],aggfunc=np.sum, fill_value=0).reset_index()
table_value = data.groupby(['mois']).sum()
table_value['% Stock losses'] = np.round(table_value['loss']/table_value['valeur'] *100,2)
table_value = table_value.transpose().reset_index()
table_value.drop([0],inplace=True)

In [65]:
data.head()

,Unnamed: 0,date_at,mois,product_type,category,country,valeur,loss,reimburse
0,0,2022-03-31 00:00:00,2022-03,Adapter Fan,accessories,Niger,40800.0,0.0,0.0
1,1,2022-03-31 00:00:00,2022-03,Adapter Fan,accessories,Nigeria,6800.0,57800.0,3400.0
2,2,2022-03-31 00:00:00,2022-03,Burn Stove,accessories,Nigeria,0.0,0.0,31500.0
3,3,2022-03-31 00:00:00,2022-03,Burn Stove Xtra,accessories,Nigeria,0.0,0.0,0.0
4,4,2022-03-31 00:00:00,2022-03,D Light Radio,accessories,Cameroun,1937166.0,0.0,0.0

In [66]:
data_age.head()

,date_at,mois,bucket,product_type,category,country,valeur
0,2022-03-31 00:00:00,2022-03,3 a 6 mois,Burn Stove Xtra,accessories,Nigeria,0.0
1,2022-03-31 00:00:00,2022-03,3 a 6 mois,D Light Radio,accessories,Cameroun,1917399.0
2,2022-03-31 00:00:00,2022-03,3 a 6 mois,Oolu SolarTV32,SHS+TV,Burkina,5236758.0
3,2022-03-31 00:00:00,2022-03,3 a 6 mois,Oolu SolarTV32,SHS+TV,Mali,3998000.0
4,2022-03-31 00:00:00,2022-03,3 a 6 mois,Oolu SolarTV32,SHS+TV,Niger,775816.0

In [67]:
table_value

mois           index       2022-03
1             valeur  4.456718e+08
2               loss  1.440206e+07
3          reimburse  4.774896e+06
4     % Stock losses  3.230000e+00

In [77]:
kpi_chart = px.line(data, x='mois', y=['valeur','loss','reimburse'], title='Valeur, perte et remboursement par mois')

In [78]:
age_chart = px.line(data_age, x='mois', y='valeur',color='bucket', title='Stock value par tranche d\'age par mois')